import { Button, Card, Divider, Input } from "antd";

export default function Notes() {
	return (
    <div className="w-1/2 mx-auto pt-6 overflow-hidden flex flex-col h-full">
      <div>
        <Input.TextArea
          placeholder="现在的想法是..."
          autoSize={{
            minRows: 6,
            maxRows: 10,
          }}
        />
        <div className="flex justify-end mt-3">
          <Button type="primary">保存</Button>
        </div>
      </div>

      <div className="mt-6 flex-1 overflow-auto">
        {[
          "是独领风骚的发是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁生了饭8多分钟被打成汁",
          "是独领风骚的发是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁生了饭8多分钟被打成汁",
          "是独领风骚的发是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁生了饭8多分钟被打成汁",
          "是独领风骚的发是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁生了饭8多分钟被打成汁",
          "是独领风骚的发是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁生了饭8多分钟被打成汁",
          "是独领风骚的发是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁生了饭8多分钟被打成汁",
          "是独领风骚的发是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁生了饭8多分钟被打成汁",
          "是独领风骚的发是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁生了饭8多分钟被打成汁",
          "是独领风骚的发是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁是独领风骚的发生了饭8多分钟被打成汁生了饭8多分钟被打成汁",
        ].map((item) => {
          return (
            <Card className="mb-3">
              <p>{item}</p>
            </Card>
          );
        })}
      </div>
    </div>
  );
}
